//#pragma once
//
//// Тест для функции возведения двойки в положительную степень.
//// Возвращает true, если всё хорошо, и false в противном случае.
//bool testForPositiveExponent(void);
//
//// Тест для функции создания дополнительного двоичного кода.
//// Возвращает true, если всё хорошо, и false в противном случае.
//bool testForCreateAdditionalCode(void);
//
//// Тест для функции создания двоичного кода десятичного числа.
//// Возвращает true, если всё хорошо, и false в противном случае.
//bool testForGenerateBinary(void);
//
//// Тест для функции создания десятичного числа по его двоичному представлению в дополнительном коде.
//// Возвращает true, если всё хорошо, и false в противном случае.
//bool testForGenerateDecimal(void);
//
//// Тест для функции сложения двух двоичных чисел.
//// Возвращает true, если всё хорошо, и false в противном случае.
//bool testForAddBinaries(void);